[{"source":{"id":null,"name":"Interesting Engineering"},"author":"Fabienne Lang","title":"Water Bears and Squid Will Hitch a Ride to the ISS - Interesting Engineering","description":"SpaceX's upcoming commercial resupply launch will carry water bears, squid, solar panels, and more to the ISS for scientific space studies.","url":"https://interestingengineering.com/water-bears-and-squid-will-hitch-a-ride-to-the-iss","urlToImage":"https://inteng-storage.s3.amazonaws.com/img/iea/k7GMXVPQOZ/sizes/bobtail-squid_md.jpg","publishedAt":"2021-05-28T12:39:10Z","content":"If you thought astronauts were the only beings to enjoy a ride to space, then think again. SpaceX and NASA's upcoming 22nd commercial resupply mission will launch live water bears and glow-in-the-dar… [+2867 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Kathleen Haughney","title":"Researchers reveal key information about how genes turn on and off - Phys.org","description":"Human bodies have roughly 30,000 genes dictating not only how we look, but also critical biological processes. Now, a Florida State University and Australia National University research team has discovered a key aspect of gene regulation and ultimately how th…","url":"https://phys.org/news/2021-05-reveal-key-genes.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2019/2-gene.jpg","publishedAt":"2021-05-28T12:27:04Z","content":"Human bodies have roughly 30,000 genes dictating not only how we look, but also critical biological processes. Now, a Florida State University and Australia National University research team has disc… [+2727 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Science X staff","title":"Electrons on the edge: Atomically thin quantum spin hall materials - Phys.org","description":"Quantum spin Hall insulators are a class of two-dimensional (2D) topological states of matter that are electrically insulating in their interior but, unlike semiconductors, carry a pair of one-dimensional (1D) metallic states, which are strictly confined to t…","url":"https://phys.org/news/2021-05-electrons-edge-atomically-thin-quantum.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2021/electrons-on-the-edge.jpg","publishedAt":"2021-05-28T12:17:07Z","content":"Quantum spin Hall insulators are a class of two-dimensional (2D) topological states of matter that are electrically insulating in their interior but, unlike semiconductors, carry a pair of one-dimens… [+3993 chars]"},{"source":{"id":null,"name":"SlashGear"},"author":"Shane McGlaun","title":"Hubble Space Telescope images galaxy NGC 2276 - SlashGear","description":"NASA and ESA have shared an image taken by the Hubble Space Telescope showing the trailing arms of a galaxy called NGC 2276. The galaxy is about 120 million light-years away from Earth in the conso…","url":"https://www.slashgear.com/hubble-space-telescope-images-galaxy-ngc-2276-28674994/","urlToImage":"https://cdn.slashgear.com/wp-content/uploads/2021/05/galaxy-crop-hub.jpg","publishedAt":"2021-05-28T12:17:00Z","content":"NASA and ESA have shared an image taken by the Hubble Space Telescope showing the trailing arms of a galaxy called NGC 2276. The galaxy is about 120 million light-years away from Earth in the consola… [+1486 chars]"},{"source":{"id":null,"name":"Live Science"},"author":"Ben Turner","title":"These worker ants drag their queens to far-off bachelor pads to mate - Livescience.com","description":"This is the first time that third-party matchmaking has been observed in non-humans.","url":"https://www.livescience.com/ants-carry-queen-to-foreign-nest.html","urlToImage":"https://cdn.mos.cms.futurecdn.net/akw6Cj7PcoGCsTUf2Bm5qV-1200-80.jpg","publishedAt":"2021-05-28T12:05:42Z","content":"Worker ants are known to take on many different job roles, from trash collectors to nurses that dress the wounds of injured comrades, to babysitters that care for their leader's young. But one Medite… [+4638 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Eric Niiler","title":"NASA’s MOXIE Experiment Is Making Oxygen on Mars - WIRED","description":"Future crews on the Red Planet will need it to make propellant for the trip home. Scientists are also testing whether oxygen can be extracted from lunar soil.","url":"https://www.wired.com/story/nasas-moxie-experiment-is-making-oxygen-on-mars/","urlToImage":"https://media.wired.com/photos/60afaaab74ef4079779bcb09/191:100/w_1280,c_limit/Science_MOXIE_PIA23154_large.jpg","publishedAt":"2021-05-28T12:00:00Z","content":"It might be a long time before any astronauts land on MarsNASA is talking about the early 2030s, while SpaceXs Elon Musk has promised it will be sooner. But when humans do touch down, they might find… [+3427 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Science X staff","title":"How retroviruses become infectious - Phys.org","description":"Understanding every step in the life cycle of a virus is crucial for identifying potential targets for treatment. Now, scientists at the Institute of Science and Technology (IST) Austria were able to show how a virus from the retrovirus family—the same family…","url":"https://phys.org/news/2021-05-retroviruses-infectious.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2021/how-retroviruses-becom.jpg","publishedAt":"2021-05-28T11:28:31Z","content":"Understanding every step in the life cycle of a virus is crucial for identifying potential targets for treatment. Now, scientists at the Institute of Science and Technology (IST) Austria were able to… [+4245 chars]"},{"source":{"id":null,"name":"Shepherdgazette.com"},"author":null,"title":"Magnetized Threads Weave Spectacular Galactic Tapestry – Watts Up With That? - The Shepherd of the Hills Gazette","description":"From NASA May 27, 2021  Back to Gallery Threads of superheated gas and magnetic fields are weaving a tapestry of energy at the center of the Milky Way","url":"https://shepherdgazette.com/magnetized-threads-weave-spectacular-galactic-tapestry-watts-up-with-that/","urlToImage":"https://shepherdgazette.com/wp-content/uploads/2021/05/gcenter-2021.jpg","publishedAt":"2021-05-28T11:26:32Z","content":"From NASA\r\nMay 27, 2021\r\n Back to Gallery\r\nThreads of superheated gas and magnetic fields are weaving a tapestry of energy at the center of the Milky Way galaxy. A new image of this new cosmic master… [+4390 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":"Associated Press","title":"NASA Mars Helicopter Ingenuity Went on a Wild Ride During Its Sixth Flight Due to Navigation Error - Gadgets 360","description":"NASA's Mars helicopter Ingenuity faced a navigation timing error during its sixth flight and went on a wild, lurching ride. This was its first major problem since it took to the Martian skies last month.","url":"https://gadgets.ndtv.com/science/news/nasa-mars-ingenuity-helicopter-flight-navigation-error-problem-issue-perseverance-jpl-2451286","urlToImage":"https://i.gadgets360cdn.com/large/ingenuity_nasa_twitter_1618824113773.jpg","publishedAt":"2021-05-28T11:16:07Z","content":"A navigation timing error sent NASA's little Mars helicopter on a wild, lurching ride, its first major problem since it took to the Martian skies last month.\r\nThe experimental helicopter, named Ingen… [+1609 chars]"},{"source":{"id":null,"name":"The Irish Sun"},"author":"Charlotte Edwards","title":"Elon Musk sending glowing baby squid and 5,000 ‘water bears’ to ISS for Nasa... - The Irish Sun","description":"","url":"https://www.thesun.ie/tech/7059467/squid-sent-to-space-nasa/","urlToImage":"https://www.thesun.ie/wp-content/uploads/sites/3/2021/05/COMP-JA-NASA-2805.jpg?strip=all&quality=100&w=1200&h=800&crop=1","publishedAt":"2021-05-28T11:07:07Z","content":"SPACEX is about to rocket 128 glow-in-the-dark baby squid into space for Nasa.\r\nElon Musk's rocket firm is also sending 5,000 'water bear' creatures on a journey to the International Space Station wh… [+4391 chars]"},{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Eric Berger","title":"Rocket Report: Russia plans nuclear space tug, Falcon Heavy launch delays - Ars Technica","description":"\"Europe really needs to build infrastructure to get to space.\"","url":"https://arstechnica.com/science/2021/05/rocket-report-russia-plans-nuclear-space-tug-falcon-heavy-launch-delays/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2021/05/2-Stonklink-29-May-26-2021-3940-760x380.jpeg","publishedAt":"2021-05-28T11:00:45Z","content":"Enlarge/ The Falcon 9 rocket launches its 100th consecutive, successful flight on Wednesday.\r\n49 with 29 posters participating\r\nWelcome to Edition 3.46 of the Rocket Report! This week we have a mix o… [+12104 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"Sophie Lewis","title":"Rare \"super flower blood moon\" lunar eclipse captured in stunning photos from around the world - CBS News","description":"Photographers didn't miss out on the chance to capture the most spectacular full moon of the year.","url":"https://www.cbsnews.com/news/lunar-eclipse-super-flower-blood-moon-2021-photos/","urlToImage":"https://cbsnews1.cbsistatic.com/hub/i/r/2021/05/26/30acfc5d-fe57-405e-abe0-ae78d746935f/thumbnail/1200x630/c980424994625940522802f842000f55/brazil.jpg","publishedAt":"2021-05-28T10:43:31Z","content":"Skywatchers around the world were treated to the most spectacular full moon of the year in the early morning hours on Wednesday. May 26 marked not just a supermoon, but also a lunar eclipse, or so-ca… [+2469 chars]"},{"source":{"id":"rt","name":"RT"},"author":"RT","title":"SpaceX competitor sounds alarm over Musk’s alleged ‘de facto monopolization’ of low-Earth orbit - RT","description":"The private space race is heating up and now Elon Musk’s competitors, which include Arianespace’s Stephane Israel, are sounding the alarm over SpaceX’s “de facto monopolization” of space.","url":"https://www.rt.com/news/525036-spacex-competitor-musk-satellite-monopoly/","urlToImage":"https://cdni.rt.com/files/2021.05/article/60b0c81085f5407072637f49.JPG","publishedAt":"2021-05-28T10:39:00Z","content":"As SpaceX’s Starlink constellation of satellites expands with each passing month, even more so now that the aerospace giant has received regulatory approval from the Federal Communications Commission… [+2440 chars]"},{"source":{"id":null,"name":"Forbes"},"author":"Jonathan O'Callaghan","title":"NASA’s Ingenuity Helicopter Nearly Spun Out Of Control On Mars Because Of A Camera Glitch - Forbes","description":"Ingenuity experienced a “stressful” moment on its sixth and latest flight earlier this week, according to NASA, when the drone began oscillating wildly due to an image processing glitch – before managing to land safely.","url":"https://www.forbes.com/sites/jonathanocallaghan/2021/05/28/nasas-ingenuity-helicopter-nearly-spun-out-of-control-on-mars-because-of-a-camera-glitch/","urlToImage":"https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F60b0c59897dfd5b7a17167d0%2F0x0.jpg","publishedAt":"2021-05-28T10:35:07Z","content":"An image of Mars taken on Ingenuity's' sixth flight from 10 meters high.\r\nNASA/JPL-Caltech\r\nIngenuity experienced a stressful moment on its sixth and latest flight earlier this week, according to NAS… [+3125 chars]"},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"\"Helium Rain Is Real!\" – Experiments Validate the Possibility of Helium Rain Inside Jupiter and Saturn - SciTechDaily","description":"Nearly 40 years ago, scientists first predicted the existence of helium rain inside planets composed primarily of hydrogen and helium, such as Jupiter and Saturn. However, achieving the experimental conditions necessary to validate this hypothesis hasn’t been…","url":"https://scitechdaily.com/helium-rain-is-real-experiments-validate-the-possibility-of-helium-rain-inside-jupiter-and-saturn/","urlToImage":"https://scitechdaily.com/images/Saturn-Illustration.gif","publishedAt":"2021-05-28T10:17:11Z","content":"An international research team, including scientists from Lawrence Livermore National Laboratory, have validated a nearly 40-year-old prediction and experimentally shown that helium rain is possible … [+4465 chars]"},{"source":{"id":null,"name":"The Irish Sun"},"author":"Niamh Cavanagh","title":"Megalodon sightings: When and where have the giant sharks been spotted?... - The Irish Sun","description":"","url":"https://www.thesun.ie/news/7058570/megalodon-sightings-when-where-giant-sharks-spotted/","urlToImage":"https://www.thesun.ie/wp-content/uploads/sites/3/2021/05/EXPLAINER-JA-SHARK2-2805.jpg?strip=all&quality=100&w=1200&h=800&crop=1","publishedAt":"2021-05-28T10:07:30Z","content":"THERE have been reported sightings of the giant megalodon despite the creature having gone extinct millions of years ago.\r\nBut when and where has the megalodon been spotted? Here is everything you ne… [+2122 chars]"},{"source":{"id":null,"name":"EurekAlert"},"author":null,"title":"Watch me move it, move it: Gliding structure in Mycoplasma mobile revealed - EurekAlert","description":"In collaboration with Kanazawa University, researchers from Osaka City University used high-speed atomic force microscopy (HS-AFM) to visualize at the nanometer level the movement of individual particles within the parasitic bacterium Mycoplasma mobile. After…","url":"https://www.eurekalert.org/pub_releases/2021-05/ocu-wmm052421.php","urlToImage":"https://www.eurekalert.org/multimedia/pub/web/265724_web.jpg","publishedAt":"2021-05-28T10:02:18Z","content":"Much of human invention and innovation has been the result of our discovery and replication of natural phenomena, from birds serving to inspire human flight, to whales allowing us to dive deep into t… [+3685 chars]"},{"source":{"id":null,"name":"Zoom"},"author":"Times Now Digital","title":"Debunked: Know the truth about the viral video showing a moon eclipsing a sun in the Arctic - Times Now","description":"The video claims to be shot at the Arctic Circle.","url":"https://www.timesnownews.com/the-buzz/article/debunked-know-the-truth-about-the-viral-video-showing-a-moon-eclipsing-a-sun-in-the-arctic/763080","urlToImage":"https://imgk.timesnownews.com/story/Add_a_heading_-_2021-05-28T145243.023.png?tr=w-560,h-292,fo-top","publishedAt":"2021-05-28T10:01:58Z","content":"A video has been doing the rounds of Twitter that has now been debunked by several fact-checking websites. Apparently, it was 'taken' at the Arctic Circle where the 'supermoon' is seen eclipsing the … [+1228 chars]"},{"source":{"id":null,"name":"Nextvame.com"},"author":"Sophia Trivett","title":"Creativity swings on the surface of Mars due to failure of navigation - NexTV Africa & Middle East","description":"A small NASA helicopter sent to Mars made an uncontrolled and wobbly flight due to a synchronization failure in navigation, its first major problem since","url":"https://nextvame.com/creativity-swings-on-the-surface-of-mars-due-to-failure-of-navigation/","urlToImage":"https://images2.listindiario.com/n/content/672/672384/p/680x460/202105280058051.jpeg","publishedAt":"2021-05-28T09:47:44Z","content":"A small NASA helicopter sent to Mars made an uncontrolled and wobbly flight due to a synchronization failure in navigation, its first major problem since it began flying across the red planet’s sky l… [+1613 chars]"},{"source":{"id":"mashable","name":"Mashable"},"author":"Mashable News Staff","title":"Scientists Finally Have The Answer To What Happened In The First Microsecond Of The Big Bang! - Mashable India","description":"The study conducted by researchers from the University of Copenhagen gives us details about what happened In the first microsecond of the big bang.","url":"https://in.mashable.com/science/22552/scientists-finally-have-the-answer-to-what-happened-in-the-first-microsecond-of-the-big-bang","urlToImage":"https://sm.mashable.com/mashable_in/seo/2/27129/27129_15tp.jpg","publishedAt":"2021-05-28T09:17:19Z","content":"Most astronomers and scientists explain Big Bang as the beginning of our universe. Its based on the idea that our universe started off as a single point which then expanded and stretched to become as… [+2235 chars]"}]