[{"source":{"id":null,"name":"SlashGear"},"author":"Shane McGlaun","title":"JAXA offers details on transformable lunar robot and lunar lander - SlashGear","description":"The Japan Aerospace Exploration Agency (JAXA) is offering details on some of the technology it plans to use on future lunar missions. The agency plans to obtain data from the surface of the moon by…","url":"https://www.slashgear.com/jaxa-offers-details-on-transformable-lunar-robot-and-lunar-lander-28674960/","urlToImage":"https://cdn.slashgear.com/wp-content/uploads/2021/05/trans-lunar-bot.jpg","publishedAt":"2021-05-28T10:39:00Z","content":"The Japan Aerospace Exploration Agency (JAXA) is offering details on some of the technology it plans to use on future lunar missions. The agency plans to obtain data from the surface of the moon by u… [+1649 chars]"},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"\"Helium Rain Is Real!\" – Experiments Validate the Possibility of Helium Rain Inside Jupiter and Saturn - SciTechDaily","description":"Nearly 40 years ago, scientists first predicted the existence of helium rain inside planets composed primarily of hydrogen and helium, such as Jupiter and Saturn. However, achieving the experimental conditions necessary to validate this hypothesis hasn’t been…","url":"https://scitechdaily.com/helium-rain-is-real-experiments-validate-the-possibility-of-helium-rain-inside-jupiter-and-saturn/","urlToImage":"https://scitechdaily.com/images/Saturn-Illustration.gif","publishedAt":"2021-05-28T10:17:11Z","content":"An international research team, including scientists from Lawrence Livermore National Laboratory, have validated a nearly 40-year-old prediction and experimentally shown that helium rain is possible … [+4465 chars]"},{"source":{"id":null,"name":"EurekAlert"},"author":null,"title":"Watch me move it, move it: Gliding structure in Mycoplasma mobile revealed - EurekAlert","description":"In collaboration with Kanazawa University, researchers from Osaka City University used high-speed atomic force microscopy (HS-AFM) to visualize at the nanometer level the movement of individual particles within the parasitic bacterium Mycoplasma mobile. After…","url":"https://www.eurekalert.org/pub_releases/2021-05/ocu-wmm052421.php","urlToImage":"https://www.eurekalert.org/multimedia/pub/web/265724_web.jpg","publishedAt":"2021-05-28T10:02:18Z","content":"Much of human invention and innovation has been the result of our discovery and replication of natural phenomena, from birds serving to inspire human flight, to whales allowing us to dive deep into t… [+3685 chars]"},{"source":{"id":null,"name":"Zoom"},"author":"Times Now Digital","title":"Debunked: Know the truth about the viral video showing a moon eclipsing a sun in the Arctic - Times Now","description":"The video claims to be shot at the Arctic Circle.","url":"https://www.timesnownews.com/the-buzz/article/debunked-know-the-truth-about-the-viral-video-showing-a-moon-eclipsing-a-sun-in-the-arctic/763080","urlToImage":"https://imgk.timesnownews.com/story/Add_a_heading_-_2021-05-28T145243.023.png?tr=w-560,h-292,fo-top","publishedAt":"2021-05-28T10:01:58Z","content":"A video has been doing the rounds of Twitter that has now been debunked by several fact-checking websites. Apparently, it was 'taken' at the Arctic Circle where the 'supermoon' is seen eclipsing the … [+1228 chars]"},{"source":{"id":null,"name":"Nextvame.com"},"author":"Sophia Trivett","title":"Creativity swings on the surface of Mars due to failure of navigation - NexTV Africa & Middle East","description":"A small NASA helicopter sent to Mars made an uncontrolled and wobbly flight due to a synchronization failure in navigation, its first major problem since","url":"https://nextvame.com/creativity-swings-on-the-surface-of-mars-due-to-failure-of-navigation/","urlToImage":"https://images2.listindiario.com/n/content/672/672384/p/680x460/202105280058051.jpeg","publishedAt":"2021-05-28T09:47:44Z","content":"A small NASA helicopter sent to Mars made an uncontrolled and wobbly flight due to a synchronization failure in navigation, its first major problem since it began flying across the red planet’s sky l… [+1613 chars]"},{"source":{"id":"mashable","name":"Mashable"},"author":"Mashable News Staff","title":"Scientists Finally Have The Answer To What Happened In The First Microsecond Of The Big Bang! - Mashable India","description":"The study conducted by researchers from the University of Copenhagen gives us details about what happened In the first microsecond of the big bang.","url":"https://in.mashable.com/science/22552/scientists-finally-have-the-answer-to-what-happened-in-the-first-microsecond-of-the-big-bang","urlToImage":"https://sm.mashable.com/mashable_in/seo/2/27129/27129_15tp.jpg","publishedAt":"2021-05-28T09:17:19Z","content":"Most astronomers and scientists explain Big Bang as the beginning of our universe. Its based on the idea that our universe started off as a single point which then expanded and stretched to become as… [+2235 chars]"},{"source":{"id":null,"name":"Advanced Science News"},"author":"Victoria Corless","title":"A robot that smiles back - Advanced Science News","description":"Researchers teach robots to make appropriate reactive human facial expressions, an ability that could build trust between humans and their robotic co-workers and care-givers.","url":"https://www.advancedsciencenews.com/a-robot-that-smiles-back/","urlToImage":"https://k9f7a9j9.rocketcdn.me/wp-content/uploads/2021/05/266166_web.jpg","publishedAt":"2021-05-28T09:12:58Z","content":"Eva mimics human facial expressions in real-time from a living stream camera. Creative Machines Lab\r\nNonverbal communication is a significant part of our ability to communicate with one another, ofte… [+6082 chars]"},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"Discovery Drives Virus Research Forward: How Retroviruses Become Infectious - SciTechDaily","description":"Scientists at IST Austria discover how the HIV-related Rous sarcoma virus is assembled driving virus research forward. Viruses are perfect molecular machines. Their only goal is to insert their genetic material into healthy cells and thus multiply. With deadl…","url":"https://scitechdaily.com/discovery-drives-virus-research-forward-how-retroviruses-become-infectious/","urlToImage":"https://scitechdaily.com/images/Capsid-Protective-Shell.gif","publishedAt":"2021-05-28T09:00:59Z","content":"The so-called capsid protects the genetic information of a virus and is far more flexible than previously thought. Its proteins are organized in hexamers (grey) and pentamers (orange). Credit: Martin… [+3797 chars]"},{"source":{"id":null,"name":"Daily Mail"},"author":"Jonathan Chadwick","title":"Divebombing killer flies lose control and miss their target, study shows - Daily Mail","description":"Killer flies can reach accelerations of 3.6g when aerial diving to catch their prey, according to new research led by the University of Cambridge.","url":"https://www.dailymail.co.uk/sciencetech/article-9628613/Divebombing-killer-flies-lose-control-miss-target-study-shows.html","urlToImage":"https://i.dailymail.co.uk/1s/2021/05/28/09/43553905-0-image-a-15_1622190986482.jpg","publishedAt":"2021-05-28T08:37:44Z","content":"Killer flies 'divebomb' towards their prey but often lose control in the air and miss their target, a new study shows.\r\nA team of researchers led by the University of Cambridge filmed the species wit… [+7256 chars]"},{"source":{"id":null,"name":"Republic World"},"author":"Apoorva Kaul","title":"Space should remain accessible: Elon Musks competitor fears monopoly by SpaceX - Republic World","description":"As Musk continues his SpaceX journey, Stephane Israel, head of Arianespace, one of SpaceX's competitors has warned that the company is monopolising space.","url":"https://www.republicworld.com/technology-news/other-tech-news/space-should-remain-accessible-elon-musks-competitor-fears-monopoly-by-spacex.html","urlToImage":"https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/vhbp5peow5vxjgro_1622187595.jpeg?tr=f-jpeg","publishedAt":"2021-05-28T08:30:00Z","content":"Tesla CEO Elon Musk's SpaceX launched 60 Starlink satellites from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station in Florida on May 27. This was the 13th Starlink launch of the… [+1739 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Monit Khanna","title":"Highest Ever Resolution Pic Of Atoms Captured By Zooming In 100 Million Times - India Times","description":"Researchers at Cornell University have broken their own record for capturing the highest resolution image of an individual atom ever captured, creating an image that’s actually zoomed in 100 million times.                         Cornell UniversityAlso Read: …","url":"https://www.indiatimes.com/technology/science-and-future/image-of-atoms-100-million-zoom-541425.html","urlToImage":"https://im.indiatimes.in/content/2021/May/Facebook-Image-38_60b0983432d58.jpg","publishedAt":"2021-05-28T08:00:12Z","content":"Researchers at Cornell University have broken their own record for capturing the highest resolution image of an individual atom ever captured, creating an image thats actually zoomed in 100 million t… [+2262 chars]"},{"source":{"id":"cbc-news","name":"CBC News"},"author":null,"title":"Studies reveal the unintended consequences of delaying surgeries, drop in ER visits due to pandemic - CBC.ca","description":"Surgery delays and a steep drop off in ER visits, contributed to a spike in excess deaths during the pandemic beyond COVID-19 deaths. Yet for some common conditions, the drop in ER visits had no impact on patient outcomes.","url":"https://www.cbc.ca/radio/whitecoat/studies-reveal-the-unintended-consequences-of-delaying-surgeries-drop-in-er-visits-due-to-pandemic-1.6040758","urlToImage":"https://i.cbc.ca/1.6041245.1622054409!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/sean-perkins-surgery.jpg","publishedAt":"2021-05-28T08:00:00Z","content":"\"If it's a COVID death or a COVID case, it's important. Otherwise it doesn't matter.\"\r\nThat's how Sean Perkins said his experience in the Ontario healthcare system during the pandemic left him feelin… [+6806 chars]"},{"source":{"id":"mashable","name":"Mashable"},"author":"Mashable News Staff","title":"NASA Shares Image Of Sparkling Istanbul Captured From International Space Station! - Mashable India","description":"National Aeronautics and Space Administration (NASA recently shared an image of Instanbul captured from ISS on its official Instagram account and the city appears to be sparkling in all its glory.","url":"https://in.mashable.com/science/22548/nasa-shares-image-of-sparkling-istanbul-captured-from-international-space-station","urlToImage":"https://sm.mashable.com/mashable_in/seo/2/27124/27124_erqb.jpg","publishedAt":"2021-05-28T07:37:36Z","content":"National Aeronautics and Space Administration (NASA recently shared an image of Instanbul captured from ISS on its official Instagram account and the city appears to be sparkling in all its glory. Th… [+1689 chars]"},{"source":{"id":null,"name":"ScienceAlert"},"author":"Michelle Starr","title":"This Startling Image of Our Galaxy's Center Hints at a New Cosmic Phenomenon - ScienceAlert","description":"The center of the Milky Way is a strange and wild place.","url":"https://www.sciencealert.com/wild-image-of-the-galactic-center-hints-at-a-new-phenomenon","urlToImage":"https://www.sciencealert.com/images/2021-05/processed/galactic-centre_1024.jpg","publishedAt":"2021-05-28T07:22:35Z","content":"The center of the Milky Way is a strange and wild place.\r\nThere dwells our galactic nucleus - a supermassive black hole 4 million times the mass of the Sun, a beast named Sgr A*. It's probably the mo… [+4178 chars]"},{"source":{"id":null,"name":"Zoom"},"author":"Times Now Digital","title":"A flaw in Einstein's theory? Largest map of universe's dark matter reveals a new cosmic puzzle - Times Now","description":"An international team of scientists mapping dark matter in the universe under the Dark Energy Survey (DES) project have now created a map that has surveyed 5,000 square degrees – nearly one-eighth of the sky.","url":"https://www.timesnownews.com/international/article/a-flaw-in-einsteins-theory-largest-map-of-universes-dark-matter-reveals-a-new-cosmic-puzzle/762988","urlToImage":"https://imgk.timesnownews.com/story/iStock-495870279.jpg?tr=w-560,h-292,fo-top","publishedAt":"2021-05-28T07:00:44Z","content":"<ul><li>The way scientists confirm the existence of dark matter is by studying the pathways of light travelling to Earth from other galaxies</li></ul>\r\n<ul><li>Having analysed the shapes, structures … [+3981 chars]"},{"source":{"id":null,"name":"CNET"},"author":"Amanda Kooser","title":"NASA Mars Ingenuity helicopter survives 'in-flight anomaly' on sixth flight - CNET","description":"The Mars helicopter's \"stressful\" flight didn't go as smoothly as the first five.","url":"https://www.cnet.com/news/nasa-mars-ingenuity-helicopter-survives-stressful-in-flight-anomaly/","urlToImage":"https://www.cnet.com/a/img/zfHAvg5AFVXplN9UB6utE0HRkro=/1200x630/2021/05/27/4d661309-cff6-45fa-93b0-27a537c42975/ingenuityafter6.jpg","publishedAt":"2021-05-28T06:44:00Z","content":"NASA's Perseverance rover snapped this image of Ingenuity on the ground on May 23, 2021, the day after its \"stressful\" sixth flight.\r\nNASA/JPL-Caltech/ASU/MSSS; red circle by Amanda Kooser/CNET\r\nThis… [+2738 chars]"},{"source":{"id":null,"name":"Forbes"},"author":"Ethan Siegel","title":"Ask Ethan: Could Our Universe Have Collided With Another, Revealing The Multiverse? - Forbes","description":"It's a wild idea, but there's a way to test it.","url":"https://www.forbes.com/sites/startswithabang/2021/05/28/ask-ethan-could-our-universe-have-collided-with-another-revealing-the-multiverse/","urlToImage":"https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5a67c9f4a7ea43169011945e%2F0x0.jpg","publishedAt":"2021-05-28T06:00:00Z","content":"An illustration of multiple, independent Universes, causally disconnected from one another in an ... [+] ever-expanding cosmic ocean, is one depiction of the Multiverse idea. The idea that two of the… [+17094 chars]"},{"source":{"id":null,"name":"The Weather Channel"},"author":null,"title":"Life on Mars? Scientists Debunk Claims of Mushrooms Sprouting on the Red Planet | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel","description":"A recent study argued that sequential photographs of Mars’ surface document fungus-like Martian specimens emerging from the soil and increasing in size. - Articles from The Weather Channel | weather.com","url":"https://weather.com/en-IN/india/space/news/2021-05-27-debunking-life-on-mars-are-mushrooms-really-sprouting-on-the-red-planet","urlToImage":"https://s.w-x.co/in-mars-3.jpg","publishedAt":"2021-05-28T05:32:57Z","content":"It is incredible how mushrooms can sprout under any circumstancesunder a park bench, in a discarded pot filled with soil, humid closet spaces, a marshy spot in the forestleaving no stone unturned. Bu… [+2119 chars]"},{"source":{"id":null,"name":"Borsonline.hu"},"author":"BorsOnline","title":"Friss adatok: tovább nőtt a koronavírus-fertőzöttek és elhunytak száma - Bors","description":"BorsOnline","url":"https://www.borsonline.hu/aktualis/koronavirus-friss-szamok/232055","urlToImage":"https://media.borsonline.hu/cikk/24/239149/big-lead/650x360/2535556_file-20200922-20-1od4f6pwebp.jpg","publishedAt":"2021-05-28T04:52:00Z","content":"A világon 168 771 637 ember fertzdött meg eddig a koronavírus-járványban, a halálos áldozatok száma 3 507 285 a baltimore-i Johns Hopkins Egyetem közép-európai id szerint péntek reggeli adatai szerin… [+1614 chars]"},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"New Research Uncovers When to Release Free and Paid Apps to Maximize Revenue - SciTechDaily","description":"Researchers from Tulane University and University of Maryland published a new paper in the Journal of Marketing that examines the dynamic interplay between free and paid versions of an app over its lifetime and suggests a possible remedy for the failure of ap…","url":"https://scitechdaily.com/new-research-uncovers-when-to-release-free-and-paid-apps-to-maximize-revenue/","urlToImage":"https://scitechdaily.com/images/App-Development.jpg","publishedAt":"2021-05-28T04:46:04Z","content":"Researchers from Tulane University and University of Maryland published a new paper in the Journal of Marketing that examines the dynamic interplay between free and paid versions of an app over its l… [+5983 chars]"}]