[{"source":{"id":"the-hindu","name":"The Hindu"},"author":"PTI","title":"IIT Mandi researchers reveal key SARS-CoV-2 protein structure - The Hindu","description":"Researchers at the Indian Institute of Technology, Mandi (IIT Mandi) in Himachal Pradesh have revealed the part of structure of a key protein in COVID-19 virus, which helps in understanding its mode o","url":"https://www.thehindu.com/sci-tech/science/iit-mandi-researchers-reveal-key-sars-cov-2-protein-structure/article34678563.ece","urlToImage":"https://www.thehindu.com/static/theme/default/base/img/og-image.jpg","publishedAt":"2021-05-29T17:19:00Z","content":"Researchers at the Indian Institute of Technology, Mandi (IIT Mandi) in Himachal Pradesh have revealed the part of structure of a key protein in COVID-19 virus, which helps in understanding its mode … [+2770 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"Ramesh Babu","title":"Kerala extends Covid lockdown by 10 days, sets the benchmark to ease curbs - Hindustan Times","description":"Kerala chief minister Pinarayi Vijayan, who extended the Covid lockdown on Saturday, said some vaccine makers have indicated interest in setting up units in Kerala and the government will do everything possible to help them. | Latest News India","url":"https://www.hindustantimes.com/india-news/kerala-extends-covid-lockdown-by-10-days-sets-the-benchmark-to-ease-curbs-101622305052629.html","urlToImage":"https://images.hindustantimes.com/img/2021/05/29/1600x900/7bb3ac7e-c098-11eb-a02f-b8472ed09407_1622305051669.jpg","publishedAt":"2021-05-29T16:17:32Z","content":"Thiruvananthapuram : Kerala chief minister Pinarayi Vijayan on Saturday extended the Covid-induced lockdown in the state by another 10 days, declaring that he would start rolling back the restriction… [+2864 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":null,"title":"Delhi extends COVID-19 curbs till June 7, relaxes norms for manufacturing, construction sectors - Moneycontrol","description":"While construction and manufacturing activities have been permitted with few riders, the movement of individuals for non-essential purposes will remain barred.","url":"https://www.moneycontrol.com/news/india/delhi-extends-covid-19-curbs-till-june-7-relaxes-norms-for-manufacturing-construction-sectors-6960101.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2021/04/4-delhi-weekend-lockdown-770x433.jpg","publishedAt":"2021-05-29T16:13:47Z","content":"The Delhi government has extended the COVID-19-related restrictions till June 7, stated an official order issued on May 29. The norms have been partially relaxed for construction and manufacturing se… [+1989 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"PTI","title":"Ramdev’s remarks: Federation of resident doctors’ associations to hold nationwide protest on June 1 - The Indian Express","description":"A controversy had erupted after he was heard questioning some of the medicines being used to treat the coronavirus infection and saying that \"lakhs have died from taking allopathic medicines for COVID-19\".","url":"https://indianexpress.com/article/india/ramdevs-remarks-doctors-associations-to-hold-nationwide-protest-on-june-1-7335841/","urlToImage":"https://images.indianexpress.com/2021/05/Ramdev-4.jpg","publishedAt":"2021-05-29T15:01:27Z","content":"Upset over Yoga guru Ramdev’s remarks on allopathy, members of the federation of resident doctors’ associations on Saturday said they will hold a nationwide protest on June 1 and observe it as a ‘bla… [+1064 chars]"},{"source":{"id":null,"name":"International Business Times, India Edition"},"author":"Manpriya Khurana","title":"Covid-19: India gives nod to vaccinate even lactating mothers; WHO, CDC cautious - IBTimes India","description":"Most of the reservations against vaccinating new mothers have stemmed from the fact that none of the vaccines have been tested on lactating mothers for efficacy or side effects","url":"https://www.ibtimes.co.in/covid-19-india-gives-nod-vaccinate-even-lactating-mothers-who-cdc-cautious-836913","urlToImage":"https://data1.ibtimes.co.in/en/full/548680/two-women-give-birth-using-mothers-womb.jpg","publishedAt":"2021-05-29T14:58:29Z","content":"Health workers also motivating covid patients\r\nIt has been a standard medical practice of modern science to wait for specific data before any medicine can be authorised for use in pregnant and lactat… [+3025 chars]"},{"source":{"id":null,"name":"The Siasat Daily"},"author":"IANS","title":"Blood cancer patients can fight COVID-19 with T cells: Study - The Siasat Daily","description":"New York: Antibodies aren't the only immune cells needed to fight off COVID-19, T cells are equally important and can step up to do the job when antibodies are depleted, suggests a new study of blood cancer patients with coronavirus. Researchers at the Univer…","url":"https://www.siasat.com/blood-cancer-patients-can-fight-covid-19-with-t-cells-study-2143579/","urlToImage":"https://cdn.siasat.com/wp-content/uploads/2020/07/COOOOOOO.jpg","publishedAt":"2021-05-29T14:58:00Z","content":"New York: Antibodies aren’t the only immune cells needed to fight off COVID-19, T cells are equally important and can step up to do the job when antibodies are depleted, suggests a new study of blood… [+2148 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"China Locks Down Neighbourhood In City Near Hong Kong After Covid Surge - NDTV","description":"A notice by the Guangzhou municipal health bureau issued Saturday identified five streets in Liwan district in the city centre as \"high-risk areas\" and ordered residents to stay indoors until door-to-door testing is completed.","url":"https://www.ndtv.com/world-news/china-locks-down-neighbourhood-in-guangzhou-city-near-hong-kong-after-covid-19-cases-surge-2452033","urlToImage":"https://c.ndtvimg.com/2021-05/f2q7s40k_guangzhou-generic-afp_625x300_29_May_21.jpg","publishedAt":"2021-05-29T14:43:16Z","content":"Guangzhou has been locked down after fresh surge in Covid cases. (AFP)\r\nBeijing, China: A neighbourhood in the southern Chinese city of Guangzhou has been locked down as officials rush to quell an up… [+869 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"PTI","title":"PM Modi announces benefits for children orphaned by Covid - Economic Times","description":"This corpus will be used to give a monthly financial support or stipend from 18 years of age for the next five years to take care of his or her personal requirements during the period of higher education. On reaching the age of 23 years, they will get the cor…","url":"https://economictimes.indiatimes.com/news/india/pm-modi-announces-benefits-for-children-orphaned-by-covid/articleshow/83066302.cms","urlToImage":"https://img.etimg.com/thumb/msid-83066334,width-1070,height-580,imgsize-551001,overlay-economictimes/photo.jpg","publishedAt":"2021-05-29T13:45:00Z","content":"On the eve of his government's second anniversary in its second term, Prime Minister Narendra Modi on Saturday announced a number of welfare measures for children who lost their parents to COVID-19, … [+3417 chars]"},{"source":{"id":null,"name":"Livemint"},"author":"Staff Writer","title":"Uttar Pradesh: Time to relax Covid lockdown restrictions, says health minister - Mint","description":"Uttar Pradesh daily Covid-19 cases declined to 52,244 from 58,270 in the past two days.Yesterday, the active coronavirus cases came down below 2,000 both in Gautam Buddh Nagar and Ghaziabad","url":"https://www.livemint.com/news/india/uttar-pradesh-time-to-relax-covid-lockdown-restrictions-says-health-minister-11622278383040.html","urlToImage":"https://images.livemint.com/img/2021/05/29/600x338/PTI05_22_2021_000102B_1622279617366_1622279631802.jpg","publishedAt":"2021-05-29T09:16:51Z","content":"The Uttar Pradesh health minister on Saturday hinted at a gradual relaxation in the lockdown rules as the state witnesses a dip in coronavirus infection.The Uttar Pradesh government had re-imposed a … [+2009 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"TIMESOFINDIA.COM","title":"Covid-19: India reports 1.73 lakh new cases, 3,617 deaths in last 24 hours - Times of India","description":"India News: India continues to maintain the declining trend in daily new Covid cases. On Saturday, the country reported 1,73,790 fresh Covid-19 cases. This is the","url":"https://timesofindia.indiatimes.com/india/covid-19-india-reports-1-73-lakh-new-cases-3617-deaths-in-last-24-hours/articleshow/83056361.cms","urlToImage":"https://static.toiimg.com/thumb/msid-83056559,width-1070,height-580,imgsize-69817,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","publishedAt":"2021-05-29T06:41:00Z","content":"Covid-19: India reports 1.73 lakh new cases, 3,617 deaths in last 24 hours\r\n<ul><li>News</li>\r\n<li>India News</li>\r\n<li>Covid-19: India reports 1.73 lakh new cases, 3,617 deaths in last 24 hours</li>… [+4 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"ANI","title":"Delhi floats global tender for 1 crore Covid-19 vaccine doses - Economic Times","description":"In the EOI, the Directorate General of Health Services (DGHS) stated that the offered vaccine must be duly approved by a competent authority of the government of India.","url":"https://economictimes.indiatimes.com/news/india/delhi-floats-global-tender-for-1-crore-covid-19-vaccine-doses/articleshow/83058085.cms","urlToImage":"https://img.etimg.com/thumb/msid-83058124,width-1070,height-580,imgsize-515839,overlay-economictimes/photo.jpg","publishedAt":"2021-05-29T06:25:00Z","content":"The Delhi government has floated a Global Expression of Interest (EOI) for the procurement of 1 crore doses of Covid-19 vaccines on an urgent basis.\r\nIn the EOI, the Directorate General of Health Ser… [+2141 chars]"},{"source":{"id":null,"name":"News18"},"author":"News18","title":"Maharashtra, Delhi Extend Covid-19 Curbs, Lockdown-like Restrictions Continue in - News18","description":"Although declining trend of fresh infections continues, several states have decided to extend the lockdown or impose fresh restrictions to contain the spread of the deadly virus.","url":"https://www.news18.com/news/india/maharashtra-delhi-extend-covid-19-curbs-lockdown-like-restrictions-continue-in-other-states-too-3788576.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2021/05/1620125875_pti05_04_2021_000085b.jpg","publishedAt":"2021-05-29T05:28:57Z","content":"Although declining trend of fresh infections continues, several states have decided to extend the lockdown or impose fresh restrictions to contain the spread of the deadly virus. In the past 24 hours… [+1258 chars]"}]