[{"source":{"id":null,"name":"News18"},"author":"Payal Mehta","title":"Nadda Discusses Covid-19 Relief Work, Poll Results on Day 1 of BJP General Secy - News18","description":"BJP national president JP Nadda chaired a key meeting of the party's general secretaries at his residence on Saturday.","url":"https://www.news18.com/news/politics/nadda-discusses-covid-19-relief-work-poll-results-on-day-1-of-bjp-general-secy-meeting-3814724.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2020/11/1605802605_jp-nadda-new.jpg","publishedAt":"2021-06-05T17:02:00Z","content":"BJP national president JP Nadda chaired a key meeting of the party’s general secretaries at his residence on Saturday. The two-day meet starting today was held to review the relief work done by party… [+6651 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":null,"title":"IndiGo Q4 net loss expands to Rs 1,147 crore amid COVID-19 second wave - Moneycontrol","description":"The domestic budget carrier's revenue from operations drops 25 percent to Rs 6,222 crore in the March quarter as against Rs 8,299 crore in the corresponding quarter in the previous year.","url":"https://www.moneycontrol.com/news/business/indigo-q4-consolidated-net-loss-expands-to-rs-1147-crore-amid-covid-19-second-wave-6993031.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2020/08/indigo-770x433.jpg","publishedAt":"2021-06-05T15:54:40Z","content":"Budget carrier Interglobe Aviation Limited (IndiGo) on June 5 announced that it registered a consolidated year-on-year net loss of Rs 1,147 crore in the fourth quarter of FY 2020-21, which ended on M… [+1906 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"TIMESOFINDIA.COM","title":"My COVID story: 'Extreme weakness and fever gave me sleepless nights' - Times of India","description":"Harshit Dayal contracted COVID-19 in the middle of April. While his symptoms were mild, excruciating body pain, wea","url":"https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/my-covid-story-extreme-weakness-and-fever-gave-me-sleepless-nights/articleshow/83259767.cms","urlToImage":"https://static.toiimg.com/thumb/msid-83259767,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-126180/83259767.jpg","publishedAt":"2021-06-05T13:30:00Z","content":"Harshit Dayal contracted COVID-19 in the middle of April. While his symptoms were mild, excruciating body pain, weakness plagued him the most. He asserts the value of starting treatment early and urg… [+6423 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":null,"title":"I'm fully vaccinated but feel sick should I get tested for COVID-19? - Moneycontrol","description":"As an infectious disease physician, I am often asked this question. The answer is yes. If you have symptoms of COVID-19, you should get tested for COVID-19 even if you are fully vaccinated. You won’t be at high risk for hospitalisation or severe disease, but …","url":"https://www.moneycontrol.com/news/india/im-fully-vaccinated-but-feel-sick-should-i-get-tested-for-covid-19-6991721.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2021/02/vaccine-1-770x433.jpg","publishedAt":"2021-06-05T08:04:07Z","content":"Imagine last night you developed a little runny nose and a sore throat. When you woke up this morning you started coughing and had a fever. In the past year, your mind would have immediately jumped t… [+3375 chars]"},{"source":{"id":null,"name":"Medical Dialogues"},"author":"Hina Zahid","title":"Previous COVID-19 infection lowers infection risk for up to 10 months: Lancet - Medical Dialogues","description":"The study fiound that residents with a previous infection were 85% less likely to be infected during ...","url":"https://medicaldialogues.in/medicine/news/previous-covid-19-infection-lowers-infection-risk-for-up-to-10-months-lancet-78309","urlToImage":"https://medicaldialogues.in/h-upload/2021/05/29/154743-covid-infection.jpg","publishedAt":"2021-06-05T04:08:10Z","content":"The study fiound that residents with a previous infection were 85% less likely to be infected during this four-month period than residents who had never been infected, while staff with past infection… [+4419 chars]"},{"source":{"id":null,"name":"Scroll.in"},"author":"Scroll Staff","title":"Covid: Pfizer vaccine produces nearly six times fewer antibodies against delta variant, shows study - Scroll.in","description":"The level of antibodies produced also declines with age and over time.","url":"https://scroll.in/latest/996703/covid-pfizer-vaccine-produces-nearly-six-times-lesser-antibodies-against-delta-variant-shows-study","urlToImage":"https://s01.sgp1.cdn.digitaloceanspaces.com/book/152005-ggarkylsoa-1607962231.jpg","publishedAt":"2021-06-04T14:33:00Z","content":"The coronavirus vaccine developed by pharmaceutical company Pfizer is likely to produce 5.8 times lower levels of antibodies against the Delta variant of the infection, according to a research publis… [+1761 chars]"},{"source":{"id":null,"name":"Wiley.com"},"author":null,"title":"The Impact of COVID‐19 on Pregnancy and Therapeutic Drug Development - Abbas‐Hanif - - British Journal of Pharmacology - Wiley Online Library - Wiley","description":"Emerging data shows pregnant women with COVID-19 are at significantly higher risk of severe outcomes compared to non-pregnant women of similar age. This review discusses the invaluable insight reveal...","url":"https://bpspubs.onlinelibrary.wiley.com/doi/10.1111/bph.15582","urlToImage":"https://bpspubs.onlinelibrary.wiley.com/cms/asset/8acf6ddf-e0f9-4436-bcac-29db629ab6d0/bph.v178.12.cover.jpg","publishedAt":"2021-06-04T14:13:22Z","content":"Corresponding Author\r\nMirzyme Therapeutics, Innovation Birmingham Campus, Faraday Wharf, Holt Street, Birmingham, B7 4BB United Kingdom\r\nChelsea and Westminster Hospital NHS Foundation Trust, 69 Fulh… [+338 chars]"}]