[{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"\"Take Care Of Children Orphaned By Covid\": Supreme Court To States - NDTV","description":"The basic needs of children orphaned since the Covid lockdown of March 2020 must be taken care of by state government, the Supreme Court said today. This includes food, shelter, and clothing, it said.","url":"https://www.ndtv.com/india-news/take-care-of-children-orphaned-by-covid-supreme-court-to-states-2451235","urlToImage":"https://c.ndtvimg.com/2021-03/6uvhghi8_supreme-court_650x400_23_March_21.jpg","publishedAt":"2021-05-28T10:25:06Z","content":"The Supreme Court will now take up the matter again on June 1.\r\nNew Delhi: The Supreme Court today came to the rescue of children orphaned during the COVID-19 lockdown, both national and state level,… [+2270 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"hindustantimes.com","title":"India to vaccinate all citizens against Covid-19 by December 2021, says Union minister Javadekar - Hindustan Times","description":"Union minister Javadekar criticised Rahul Gandhi during his press conference and said that he should take note that India will vaccinate at least 108 crore people by December this year. | Latest News India","url":"https://www.hindustantimes.com/india-news/india-to-vaccinate-all-against-covid-19-by-december-2021-says-javadekar-101622194097804.html","urlToImage":"https://images.hindustantimes.com/img/2021/05/28/1600x900/20210514237L_1622194133187_1622194140937.jpg","publishedAt":"2021-05-28T09:30:44Z","content":"Union minister Prakash Javadekar said on Friday all Indians will be vaccinated against the coronavirus disease (Covid-19) by the end of this year as he criticised Congress leader Rahul Gandhi for say… [+2318 chars]"},{"source":{"id":null,"name":"Livemint"},"author":"Saumya Tewari","title":"Instagram to host live music festival to raise funds for covid-19 relief efforts - Mint","description":"The festival is a part of Facebook's ‘Social For Good’ initiative which supports large community causes by bringing together public figures and creators to raise awareness and funding","url":"https://www.livemint.com/companies/news/instagram-to-host-live-music-festival-to-raise-funds-for-covid-19-relief-efforts-11622191821932.html","urlToImage":"https://images.livemint.com/img/2021/05/28/600x338/Live_In_Your_Living_Room_-_teaser_1622192394755_1622192419849.png","publishedAt":"2021-05-28T09:00:45Z","content":"NEW DELHI: Instagram on Friday said that it is partnering with Indian artists to host a live music festival to raise funds for covid-19 relief efforts.The festival 'Live In Your Living Room will feat… [+1990 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Express Web Desk","title":"‘Important step’ for ‘robust conclusions’: India supports WHO’s Covid-19 origins study - The Indian Express","description":"This Covid-19 follow up by the WHO, MEA said, deserves the understanding and cooperation of all.","url":"https://indianexpress.com/article/india/india-supports-whos-covid-19-origins-study-7333893/","urlToImage":"https://images.indianexpress.com/2021/05/Covid-29.jpg","publishedAt":"2021-05-28T08:40:52Z","content":"A day after the United States asked asked American intelligence agencies to find out how Covid-19 emerged in China, India on Friday supported renewed global calls for a comprehensive investigation by… [+2009 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Sputnik V Covid Vaccine To Be Rolled Out At Rs 1,195 In Apollo Hospitals - NDTV","description":"Apollo Group of Hospitals has announced that it will start administering the Russian Covid-19 vaccine Sputnik V, across its hospitals in India from the second week of June, at an estimated price of Rs 1,195 per dose.","url":"https://www.ndtv.com/india-news/sputnik-v-covid-19-vaccine-to-be-rolled-out-at-rs-1-195-in-apollo-hospitals-2451079","urlToImage":"https://c.ndtvimg.com/2021-04/8tsi6kqo_sputnik-v_625x300_13_April_21.jpg","publishedAt":"2021-05-28T07:58:57Z","content":"Sputnik V was registered in India under emergency use authorization procedure (File)\r\nNew Delhi: Apollo Group of Hospitals has announced that it will start administering the Russian Covid-19 vaccine … [+2925 chars]"},{"source":{"id":null,"name":"India.com"},"author":"India.com News Desk","title":"CBSE Class 12 Board Exam 2021: SC Adjourns Hearing of Plea Seeking Cancellation of Exams Till May 31 | Highli - India.com","description":"Cancel CBSE Class 12 Board Exam 2021 Plea Hearing: Supreme Court adjourns to Monday, the plea seeking cancellation of Class 12 examinations of CBSE and ICSE due to COVID situation. Court has directed petitioner Adv Mamta Sharma to serve an advanced copy to re…","url":"https://www.india.com/education/cbse-class-12-board-exam-2021-live-updates-cancel-cbse-cisce-class-12-board-exams-plea-hearing-in-supreme-court-today-latest-updates-4696782/","urlToImage":"https://static.india.com/wp-content/uploads/2021/05/CBSE-Class-12th-Board-Exam.jpg","publishedAt":"2021-05-28T07:40:43Z","content":"Home &gt; Exams &amp; Results\r\nUpdated: May 28, 2021 1:10 PM IST \r\nBy India.com News DeskEmail\r\nEdited by Surabhi ShauryaEmailFollow\r\nNew Delhi: The Supreme Court on Friday adjourned the hearing in a… [+4513 chars]"},{"source":{"id":null,"name":"News18"},"author":"News18","title":"DRDOs Anti-Covid Drug To be Sold for Rs 990 per Sachet; Govt Hospitals to Get Di - News18","description":"DRDO’s 2DG anti-Covid-19 drug has been priced at Rs 990 per sachet by Dr Reddy’s lab.","url":"https://www.news18.com/news/india/drdos-anti-covid-drug-priced-at-rs-990-per-sachet-govt-hospitals-to-be-provided-at-discounted-rates-3785678.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2021/05/1621228907_drdo.jpg","publishedAt":"2021-05-28T07:26:00Z","content":"DRDOs 2DG anti-Covid-19 drug has been priced at Rs 990 per sachet by Dr Reddys lab. Government officials were quoted by ANI saying that central and state government hospitals would be provided with t… [+1992 chars]"},{"source":{"id":null,"name":"News18"},"author":"News18","title":"Once BMCs Gordian Knot, How Mumbais Dharavi Beat Covid-19 Twice - News18","description":"After reporting close to 99 Covid-19 cases in April daily, Mumbai's slum colony of Dharavi has seen a gradual and significant drop in infections in the last couple of days with the tally of patients under treatment dropping to 50, marking a turnaround in the …","url":"https://www.news18.com/news/india/once-bmcs-gordian-knot-how-mumbais-dharavi-beat-covid-19-twice-3785369.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2020/11/1605544154_1589004183_mumbai-maharashtra-coronavirus.jpg","publishedAt":"2021-05-28T06:50:49Z","content":"After reporting close to 99 Covid-19 cases in April daily, Mumbai’s slum colony of Dharavi has seen a gradual and significant drop in infections in the last couple of days with the tally of patients … [+4153 chars]"},{"source":{"id":null,"name":"Sakshi.com"},"author":"Sakshi Post","title":"Telangana Sees A Spike in Black Fungus Cases - Sakshi Post","description":"While Coronavirus Cases in Telangana state are on the decline, the number of black fungus cases among Covid patients in...","url":"https://english.sakshi.com/news/telangana/telangana-sees-spike-black-fungus-cases-136095","urlToImage":"https://english.sakshi.com/sites/default/files/styles/hindi_400x300/public/article_images/2021/05/28/1-1622182755.jpg?itok=10571mpg","publishedAt":"2021-05-28T06:19:15Z","content":"While Coronavirus Cases in Telangana state are on the decline, the number of black fungus cases among Covid patients in the state continues to rise. According to the data from health authorities, the… [+1570 chars]"},{"source":{"id":null,"name":"India Today"},"author":null,"title":"Over 56% of Covid-19 patients with secondary infection have died, finds ICMR study - India Today","description":"Over half of those Covid-19 patients, who developed a secondary bacterial or fungal infection, have died, found a new study by ICMR.","url":"https://www.indiatoday.in/coronavirus-outbreak/story/most-covid-patients-with-secondary-infection-died-icmr-study-1807952-2021-05-28","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202105/delhi_hospital_covid_pti_3-647x363.jpeg?..QNtEfgVpQ.YkzbPLFkJ4Z0zZTteVbP","publishedAt":"2021-05-28T05:56:09Z","content":"In a new study conducted across 10 hospitals of the country, ICMR has found that over half of those Covid-19 patients who had developed a secondary infection, had died.\r\nThe retrospective study of se… [+2232 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Australia's Covid Success Under Threat As Melbourne Goes Into Lockdown - NDTV","description":"Five million weary Melbourne residents were put back under lockdown on Friday, straining local resolve and testing Australia's \"zero-Covid\" strategy of smothering outbreaks however small.","url":"https://www.ndtv.com/world-news/australias-covid-success-under-threat-as-melbourne-goes-into-lockdown-2450946","urlToImage":"https://c.ndtvimg.com/2021-05/pir5fg58_melbourne-lockdown-afp_625x300_28_May_21.jpg","publishedAt":"2021-05-28T05:39:55Z","content":"Melbourne goes into a seven days lockdown to stall coronavirus transmission.\r\nAustralia: Five million weary Melbourne residents were put back under lockdown on Friday, straining local resolve and tes… [+3208 chars]"}]