[{"source":{"id":null,"name":"The Indian Express"},"author":"Sports Desk","title":"UEFA Champions League Final, Manchester City vs Chelsea Live Score: Starting XIs out - The Indian Express","description":"Manchester City vs Chelsea, UEFA Champions League Final 2021 Live Score Streaming Online Updates: City is making their debut on this stage while Chelsea will be featuring in their third final.","url":"https://indianexpress.com/article/sports/football/uefa-champions-league-2021-final-manchester-city-vs-chelsea-live-score-updates-7335659/","urlToImage":"https://images.indianexpress.com/2021/05/city-chelsea.jpg","publishedAt":"2021-05-29T18:28:00Z","content":"Manchester City: Ederson, Walker, Dias, Stones, Zinchenko, Gundogan, De Bruyne, Bernardo, Mahrez, Sterling, Foden.\r\nSubs: Steffen, Carson, Ake, Jesus, Aguero, Laporte, Rodrigo, Torres, Mendy, Fernand… [+266 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"TIMESOFINDIA.COM","title":"Weight loss: Common burpee mistakes that could sabotage your workout - Times of India","description":"This high impact, plyometric moves combine a vertical jump with a quick transition into a push-up.","url":"https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/weight-loss-common-burpee-mistakes-that-could-sabotage-your-workout/photostory/83068104.cms","urlToImage":"https://static.toiimg.com/photo/83068122.cms","publishedAt":"2021-05-29T17:30:00Z","content":"Muscle targeted: Burpees help to build strength in both your lower and upper body. This exercise primarily works on your legs, hips, buttocks, abdomen, arms, chest, and shoulders.\r\nStep 1: Stand stra… [+470 chars]"},{"source":{"id":"the-hindu","name":"The Hindu"},"author":"PTI","title":"IIT Mandi researchers reveal key SARS-CoV-2 protein structure - The Hindu","description":"Researchers at the Indian Institute of Technology, Mandi (IIT Mandi) in Himachal Pradesh have revealed the part of structure of a key protein in COVID-19 virus, which helps in understanding its mode o","url":"https://www.thehindu.com/sci-tech/science/iit-mandi-researchers-reveal-key-sars-cov-2-protein-structure/article34678563.ece","urlToImage":"https://www.thehindu.com/static/theme/default/base/img/og-image.jpg","publishedAt":"2021-05-29T17:19:00Z","content":"Researchers at the Indian Institute of Technology, Mandi (IIT Mandi) in Himachal Pradesh have revealed the part of structure of a key protein in COVID-19 virus, which helps in understanding its mode … [+2770 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Entertainment Desk","title":"When Salman Khan gave acceptance speech on Shah Rukh Khan's behalf because he felt he 'doesn't get any awards' - Hindustan Times","description":"At a 1998 awards ceremony, Shah Rukh Khan invited Salman Khan to deliver an acceptance speech on his behalf, because, he said, 'he feels mujhko saare awards milte hain usko nahi milta (I get all the awards and he doesn't)'. | Entertainment News","url":"https://www.hindustantimes.com/entertainment/bollywood/when-salman-khan-gave-acceptance-speech-on-shah-rukh-khan-s-behalf-because-he-felt-he-doesn-t-get-any-awards-101622278167164.html","urlToImage":"https://images.hindustantimes.com/img/2021/05/29/1600x900/srk_salman_1622279227833_1622279237423.JPG","publishedAt":"2021-05-29T17:02:43Z","content":"Actors Shah Rukh Khan and Salman Khan buried the hatchet a few years ago, and have since collaborated on several projects together. But before their years-long feud, the two were pally with each othe… [+1818 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"Ramesh Babu","title":"Kerala extends Covid lockdown by 10 days, sets the benchmark to ease curbs - Hindustan Times","description":"Kerala chief minister Pinarayi Vijayan, who extended the Covid lockdown on Saturday, said some vaccine makers have indicated interest in setting up units in Kerala and the government will do everything possible to help them. | Latest News India","url":"https://www.hindustantimes.com/india-news/kerala-extends-covid-lockdown-by-10-days-sets-the-benchmark-to-ease-curbs-101622305052629.html","urlToImage":"https://images.hindustantimes.com/img/2021/05/29/1600x900/7bb3ac7e-c098-11eb-a02f-b8472ed09407_1622305051669.jpg","publishedAt":"2021-05-29T16:17:32Z","content":"Thiruvananthapuram : Kerala chief minister Pinarayi Vijayan on Saturday extended the Covid-induced lockdown in the state by another 10 days, declaring that he would start rolling back the restriction… [+2864 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":null,"title":"Delhi extends COVID-19 curbs till June 7, relaxes norms for manufacturing, construction sectors - Moneycontrol","description":"While construction and manufacturing activities have been permitted with few riders, the movement of individuals for non-essential purposes will remain barred.","url":"https://www.moneycontrol.com/news/india/delhi-extends-covid-19-curbs-till-june-7-relaxes-norms-for-manufacturing-construction-sectors-6960101.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2021/04/4-delhi-weekend-lockdown-770x433.jpg","publishedAt":"2021-05-29T16:13:47Z","content":"The Delhi government has extended the COVID-19-related restrictions till June 7, stated an official order issued on May 29. The norms have been partially relaxed for construction and manufacturing se… [+1989 chars]"},{"source":{"id":null,"name":"Thewire.in"},"author":null,"title":"Government Assault on Digital Media Reflects Modi's Paranoia - The Wire","description":"By taking on big tech at a time when it tries to pulverize critics online, the BJP may have bitten off more than it could chew.","url":"https://thewire.in/government/attack-on-free-speech-reflects-modis-growing-paranoia","urlToImage":"https://cdn.thewire.in/wp-content/uploads/2021/05/17151648/modi-770x400.jpg","publishedAt":"2021-05-29T16:08:33Z","content":"There is much hypocrisy in the ongoing confrontation between the Modi government and big tech platforms, mainly Twitter and Facebook, given that the ruling BJP government has by far been the most suc… [+10673 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":null,"title":"Bank of Baroda posts Q4 loss at Rs 1,046.5 crore despite lower provisions; asset quality improves - Moneycontrol.com","description":"The bank said the slippages ratio declined to 2.71 percent as of FY21, against 2.97 percent in FY20, and credit cost ratio also dropped significantly to 1.68 percent from 2.35 percent in the same period.","url":"https://www.moneycontrol.com/news/trends/bank-of-baroda-posts-q4-loss-at-rs-1046-5-crore-despite-lower-provisions-asset-quality-improves-6960061.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2021/03/bank-of-baroda-770x433.jpg","publishedAt":"2021-05-29T15:23:45Z","content":"Public sector lender Bank of Baroda on May 29 posted a loss of Rs 1,046.5 crore for the quarter ended March 2021 despite falling provisions as tax costs hit the balance sheet. However, higher other i… [+2459 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"hindustantimes.com","title":"'That is why we are taking IPL to the UAE': BCCI secretary explains decision to move T20 tournament outside India - Hindustan Times","description":"The decision to move the tournament outside of India was explained by BCCI secretary Jay Shah, who revealed that the call was taken due to weather restrictions.","url":"https://www.hindustantimes.com/cricket/that-is-why-we-are-taking-ipl-to-the-uae-bcci-secretary-jay-shah-explains-decision-to-move-t20-tournament-outside-india-101622301452649.html","urlToImage":"https://images.hindustantimes.com/img/2021/05/29/1600x900/ipl-trophy-new-twitter'_1622301506922_1622301517322.jpg","publishedAt":"2021-05-29T15:20:22Z","content":"The biggest takeaway from the BCCIs AGM meeting on Saturday was a confirmation that the IPL 2021, which was suspended indefinitely earlier this month, its remaining matches would be contested in the … [+1850 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"Rahul Singh","title":"‘First step on long road’: Army chief’s assessment of 3-month-long LoC ceasefire - Hindustan Times","description":"Army chief General MM Naravane said the ceasefire between Indian and Pakistani militaries along the LoC has definitely led to an improvement in the security situation and benefited civilians living in forward areas. | Latest News India","url":"https://www.hindustantimes.com/india-news/first-step-on-long-road-army-chief-s-assessment-on-3-month-long-loc-ceasefire-101622300552661.html","urlToImage":"https://images.hindustantimes.com/img/2021/05/29/1600x900/1bf70bd8-c08d-11eb-a02f-b8472ed09407_1622301151276.jpg","publishedAt":"2021-05-29T15:02:32Z","content":"New Delhi: Army chief General Manoj Mukund Naravane has said that the restoration of ceasefire in February between Indian and Pakistani militaries along the Line of Control (LoC) in Jammu and Kashmir… [+3860 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"PTI","title":"Ramdev’s remarks: Federation of resident doctors’ associations to hold nationwide protest on June 1 - The Indian Express","description":"A controversy had erupted after he was heard questioning some of the medicines being used to treat the coronavirus infection and saying that \"lakhs have died from taking allopathic medicines for COVID-19\".","url":"https://indianexpress.com/article/india/ramdevs-remarks-doctors-associations-to-hold-nationwide-protest-on-june-1-7335841/","urlToImage":"https://images.indianexpress.com/2021/05/Ramdev-4.jpg","publishedAt":"2021-05-29T15:01:27Z","content":"Upset over Yoga guru Ramdev’s remarks on allopathy, members of the federation of resident doctors’ associations on Saturday said they will hold a nationwide protest on June 1 and observe it as a ‘bla… [+1064 chars]"},{"source":{"id":null,"name":"Bollywood Hungama"},"author":"Bollywood Hungama","title":"Kamaal R Khan calls Mika Singh ‘chirkut singer’ after being called ‘gadha’ by him - Bollywood Hungama","description":"Kamaal R Khan calls Mika Singh ‘chirkut singer’ after being called ‘gadha’ by him Bollywood News: Latest Bollywood News, Bollywood News Today, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News, Bollywood News Hindi, Hindi Bollywood News at…","url":"https://www.bollywoodhungama.com/news/features/nancy-jain-shares-deleted-family-track-glimpses-with-salman-khan-in-radhe-your-most-wanted-bhai/","urlToImage":"https://stat2.bollywoodhungama.in/wp-content/uploads/2021/05/Kamaal-R-Khan-calls-Mika-Singh-‘chirkut-singer’-after-being-called-‘gadha’-by-him.jpg","publishedAt":"2021-05-29T14:59:28Z","content":"Actor and self-proclaimed critic Kamaal R Khan, better known as KRK, continues to stay in the headlines. He recently slammed singer Mika Singh who criticized him to defend Salman Khan.\r\nWhile Kamaal … [+2080 chars]"},{"source":{"id":null,"name":"International Business Times, India Edition"},"author":"Manpriya Khurana","title":"Covid-19: India gives nod to vaccinate even lactating mothers; WHO, CDC cautious - IBTimes India","description":"Most of the reservations against vaccinating new mothers have stemmed from the fact that none of the vaccines have been tested on lactating mothers for efficacy or side effects","url":"https://www.ibtimes.co.in/covid-19-india-gives-nod-vaccinate-even-lactating-mothers-who-cdc-cautious-836913","urlToImage":"https://data1.ibtimes.co.in/en/full/548680/two-women-give-birth-using-mothers-womb.jpg","publishedAt":"2021-05-29T14:58:29Z","content":"Health workers also motivating covid patients\r\nIt has been a standard medical practice of modern science to wait for specific data before any medicine can be authorised for use in pregnant and lactat… [+3025 chars]"},{"source":{"id":null,"name":"The Siasat Daily"},"author":"IANS","title":"Blood cancer patients can fight COVID-19 with T cells: Study - The Siasat Daily","description":"New York: Antibodies aren't the only immune cells needed to fight off COVID-19, T cells are equally important and can step up to do the job when antibodies are depleted, suggests a new study of blood cancer patients with coronavirus. Researchers at the Univer…","url":"https://www.siasat.com/blood-cancer-patients-can-fight-covid-19-with-t-cells-study-2143579/","urlToImage":"https://cdn.siasat.com/wp-content/uploads/2020/07/COOOOOOO.jpg","publishedAt":"2021-05-29T14:58:00Z","content":"New York: Antibodies aren’t the only immune cells needed to fight off COVID-19, T cells are equally important and can step up to do the job when antibodies are depleted, suggests a new study of blood… [+2148 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Entertainment Desk","title":"Shahid Kapoor's wife Mira Rajput wishes father-in-law Pankaj Kapur on his birthday with throwback pic - Hindustan Times","description":"Shahid Kapoor's wife Mira Rajput has wished her father-in-law, Pankaj Kapur, on his 67th birthday. See picture. | Entertainment News","url":"https://www.hindustantimes.com/entertainment/bollywood/shahid-kapoor-s-wife-mira-rajput-wishes-father-in-law-pankaj-kapur-on-his-birthday-with-throwback-pic-101622297611266.html","urlToImage":"https://images.hindustantimes.com/img/2021/05/29/1600x900/pankaj-mira_1622298055225_1622298058653.jpg","publishedAt":"2021-05-29T14:48:32Z","content":"Mira Rajput, wife of actor Shahid Kapoor, on Saturday wished her father-in-law, actor Pankaj Kapur, as he rang in his 67th birthday. Taking to Instagram Stories, Mira shared a picture of Pankaj and w… [+1841 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"China Locks Down Neighbourhood In City Near Hong Kong After Covid Surge - NDTV","description":"A notice by the Guangzhou municipal health bureau issued Saturday identified five streets in Liwan district in the city centre as \"high-risk areas\" and ordered residents to stay indoors until door-to-door testing is completed.","url":"https://www.ndtv.com/world-news/china-locks-down-neighbourhood-in-guangzhou-city-near-hong-kong-after-covid-19-cases-surge-2452033","urlToImage":"https://c.ndtvimg.com/2021-05/f2q7s40k_guangzhou-generic-afp_625x300_29_May_21.jpg","publishedAt":"2021-05-29T14:43:16Z","content":"Guangzhou has been locked down after fresh surge in Covid cases. (AFP)\r\nBeijing, China: A neighbourhood in the southern Chinese city of Guangzhou has been locked down as officials rush to quell an up… [+869 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Mamata Banerjee Insulted PM: BJP's Suvendu Adhikari On Cyclone Meeting Row - NDTV","description":"Mamata Banerjee did not attend the meeting but entered the room from where PM Narendra Modi was holding the meeting.","url":"https://www.ndtv.com/india-news/cyclone-yaas-meeting-row-mamata-banerjee-insulted-pm-narendra-modi-bjps-suvendu-adhikari-2452001","urlToImage":"https://c.ndtvimg.com/2021-05/7m97k4e8_suvendu-adhikari-facebook_625x300_20_May_21.jpg","publishedAt":"2021-05-29T13:50:31Z","content":"Suvendu Adhikari criticised Mamata Banerjee on row over meeting with PM Narendra Modi. (File) row.\r\nKolkata: Leader of the opposition in West Bengal Chief Minister Suvendu Adhikari on Saturday allege… [+1322 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"PTI","title":"PM Modi announces benefits for children orphaned by Covid - Economic Times","description":"This corpus will be used to give a monthly financial support or stipend from 18 years of age for the next five years to take care of his or her personal requirements during the period of higher education. On reaching the age of 23 years, they will get the cor…","url":"https://economictimes.indiatimes.com/news/india/pm-modi-announces-benefits-for-children-orphaned-by-covid/articleshow/83066302.cms","urlToImage":"https://img.etimg.com/thumb/msid-83066334,width-1070,height-580,imgsize-551001,overlay-economictimes/photo.jpg","publishedAt":"2021-05-29T13:45:00Z","content":"On the eve of his government's second anniversary in its second term, Prime Minister Narendra Modi on Saturday announced a number of welfare measures for children who lost their parents to COVID-19, … [+3417 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":"Vineet Washington","title":"Realme Smart TV 4K Specifications, Price in India Surface Online Ahead of May 31 Launch - Gadgets 360","description":"Realme Smart TV 4K will include a 43-ich and a 50-inch model, both of which are expected to come with 4K resolution. They have been tipped to cost between Rs. 28,000 and 30,000 for the 43-inch model and between Rs. 33,000 and Rs.35,000 for the 50-inch model.","url":"https://gadgets.ndtv.com/tv/news/realme-smart-tv-4k-price-in-india-rs-28000-33000-specifications-leak-launch-may-31-2451977","urlToImage":"https://i.gadgets360cdn.com/large/Realme_smart_tv_4k_specs_1622292790947.jpg","publishedAt":"2021-05-29T13:00:31Z","content":"Realme Smart TV 4K specifications and pricing in India have allegedly been leaked ahead of its May 31 launch. The company will launch two models 43-inch and 50-inch both of which will feature voice a… [+2167 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Olympian Sushil Kumar \"Mastermind\" Of Wrestler's Murder, Say Cops - NDTV","description":"Olympic medallist Sushil Kumar, arrested in a murder case, has been sent to four days in police custody today. The wrestler was arrested last week for his alleged involvement in the death of a 23-year-old wrestler at Delhi's Chhatrasal Stadium, along","url":"https://www.ndtv.com/india-news/olympian-wrestler-sushil-kumar-sent-to-4-day-police-custody-in-murder-case-2451945","urlToImage":"https://c.ndtvimg.com/2021-05/mam0a0to_wrestler-sushil-kumar-arrested-in-connection-with-chhatrasal-stadium-brawl-pti_625x300_25_May_21.jpg","publishedAt":"2021-05-29T12:02:01Z","content":"Wrestler Sushil Kumar had been on the run for nearly three weeks (File)\r\nNew Delhi: Olympic medallist Sushil Kumar, arrested in a murder case, was called the \"mastermind\" of the fatal attack by the p… [+2120 chars]"}]